[
  {
    "index": "1",
    "start_time": "4/4/25 19:03:51",
    "completion_time": "4/4/25 19:20:18",
    "email": "anischita.saha@ocadu.ca",
    "name": "Anischita Saha",
    "modified_time": "",
    "preferred_name": "Anischita (Ani) Saha ",
    "pronouns": "she/her",
    "website": "https://ani-saha.format.com/",
    "social_media": "Instagram: @aniii.saha, @jellybeanani\nLinkedin: Anischita (Ani) Saha",
    "work_email": "anischitasaha64@gmail.com",
    "project_name": "",
    "project_description": "Package design ",
    "bio": "Anischita Saha (Ani) is a Toronto-based graphic designer and animator in her fourth year at OCAD University, majoring in Graphic Design. Her creative practice spans package design, branding, motion graphics, and typeface design, with a strong focus on accessibility and sustainability. Ani is passionate about crafting thoughtful, impactful work that fosters connection—whether through collaborative group projects or self-directed explorations.\n\nHer playful curiosity carries into her personal life as well: when she's not designing, you’ll likely find her sculpting with clay, snorkeling, or hanging out with her beloved collection of frog plushies (one of which has attended every single class). 🐸\n",
    "comments": ""
  },
  {
    "index": "2",
    "start_time": "4/15/25 8:16:36",
    "completion_time": "4/15/25 8:45:26",
    "email": "bpetrut@ocadu.ca",
    "name": "Brianna Petrut",
    "modified_time": "",
    "preferred_name": "Brianna Petrut",
    "pronouns": "she/her",
    "website": "https://www.bripdesign.com/",
    "social_media": "LinkedIn: https://www.linkedin.com/in/brianna-petrut/",
    "work_email": "Hello@bripdesign.com",
    "project_name": "",
    "project_description": "This self-promotional portfolio is my playful answer to cut through the massive amounts of online applications that hiring teams are bombarded with. No more getting lost in a sea of PDFs and polite emails, especially with every job posting bringing in hundreds of applicants, with even more with new graduates every spring.\n\nPrinted on lightweight newsprint, it’s designed to be mailed easily, handed out effortlessly, and remembered long after for future opportunities. It’s more than a business card, it’s a conversation starter.\n\nI’ll be handing them out in person at GradEx, so come say hi at my booth on the 6th floor and grab a copy!",
    "bio": "Brianna is a bilingual interdisciplinary designer with experience in The Industry™ since 2020. Currently at an award-winning marketing firm, and formerly at a not-for-profit arts organisation. She specializes in delivering high-impact assets on a budget, while creating unexpected solutions for branding, web, motion, and the occasional print project.",
    "comments": "PLEASE READ: Hey ya'll, I know I'm submitting a little early. But I just wanted to note that I do NOT want these pictures publicly available until the 28th of April, if possible. Just because that's when I'll be posting them for the first time on my own channels :)\n\nOtherwise, I did label the images in the order I would like them to be in if that's possible."
  },
  {
    "index": "3",
    "start_time": "4/20/25 23:00:44",
    "completion_time": "4/20/25 23:48:18",
    "email": "bricelan@ocadu.ca",
    "name": "Brice Lan",
    "modified_time": "",
    "preferred_name": "Brice Lan",
    "pronouns": "he/him",
    "website": "https://bricelan.ca/",
    "social_media": "Instagram: @landesignlab\nYouTube: https://www.youtube.com/@flurfdesign\nLinkedIn: https://www.linkedin.com/in/bricelan/",
    "work_email": "bricexlan@gmail.com",
    "project_name": "",
    "project_description": "Have you ever gotten lost while taking transit? You're not alone. The Greater Toronto Hamilton Area (GTHA) has the largest transit expansion plan in North America, but finding your way through this region-wide system remains a challenge. This project focuses on developing a unified digital wayfinding system using dynamic information and real-time updates to make navigation easy and convenient for users across the region.",
    "bio": "I am a multidisciplinary designer, content creator, and urbanist based in Toronto with a background in fine arts. I am passionate about connecting audiences to complex ideas, stories, and systems by making them easy to understand.",
    "comments": ""
  },
  {
    "index": "4",
    "start_time": "4/22/25 22:29:40",
    "completion_time": "4/22/25 22:49:32",
    "email": "anischita.saha@ocadu.ca",
    "name": "Anischita Saha",
    "modified_time": "",
    "preferred_name": "Anischita Saha (Ani)",
    "pronouns": "she/her",
    "website": "https://ani-saha.format.com/",
    "social_media": "Instagram: @jellybeanani\nInstagram: @aniiii.saha\nlinkedin: Anischita Saha",
    "work_email": "anischitasaha64@gmail.com",
    "project_name": "",
    "project_description": "What if design could help people heal, navigate the world, and feel seen?\n\nAnischita Saha (@jellybeanani) is a Graphic Design student whose work is rooted in accessibility, sustainability and care.\n\nHer projects, like Cafune, a reimagined shampoo and conditioner system for visually impaired users, and Sip Well, a freeze-dried smoothie for those healing from eating disorders, are designed to meet real needs with empathy and intention.\n\n\"I do struggle with a disability myself, and I think that experience sort of changed me and pushed me to make work that actually helps people in the real world.\"\n\nBy centering the lived experiences of others, Anischita is rethinking how design can serve - not just sell. Each project is a thoughtful gesture toward a more inclusive world.",
    "bio": "Anischita Saha (Ani) is a Toronto-based graphic designer and\nanimator in her fourth year at OCAD University, majoring in Graphic\nDesign. Her creative practice spans package design, branding,\nmotion graphics, and typeface design, with a strong focus on\naccessibility and sustainability. Ani is passionate about crafting\nthoughtful, impactful work that fosters connection—whether\nthrough collaborative group projects or self-directed explorations.\n\nHer playful curiosity carries into her personal life as well: when she's\nnot designing, you’ll likely find her sculpting with clay, snorkeling, or\nhanging out with her beloved collection of frog plushies (one of\nwhich has attended every single class). 🐸",
    "comments": ""
  },
  {
    "index": "5",
    "start_time": "4/23/25 10:21:27",
    "completion_time": "4/23/25 10:40:21",
    "email": "alisonrepetski@ocadu.ca",
    "name": "Alison Repetski",
    "modified_time": "",
    "preferred_name": "Alison Repetski",
    "pronouns": "she/her",
    "website": "alisonrepetski.ca",
    "social_media": "Instagram: @alisonrepetski.gd\nLinkedIn: www.linkedin.com/in/alison-repetski-49b9a5263\n",
    "work_email": "projects@alisonrepetski.ca",
    "project_name": "",
    "project_description": "Commensality is the union of food, togetherness and space. A turn from the biological need for nourishment, to the social need for togetherness. \"Join Me at the Dining Table\" is a unique and interactive installation piece that guides viewers through four foundational elements of commensality, that is: memory, tradition, faith and invitation. Viewers are also encouraged to engage in dinner conversation as they move through the dining experience, generating commensality in real time.\n\nCommensality is an inescapable and important factor of the human experience, and even so it is a ritual that is becoming lost (or rare) due to the widescale loneliness and isolation epidemic. \"Join Me At the Dining Table\" asks viewers to reflect on the meaning of their own dining table. How has it been a factor in the development of their identity? Is there more at the dining table than they are letting themselves experience?",
    "bio": "Alison Repetski is a Toronto based Graphic Designer with a specific interest in digital and publication design. From time to time, Alison blends the digital with the real world, building tactile objects meant to be physically experienced and engaged with. She hopes that the end user connects with her design work in a way that leaves them thinking, even long after engaging with the work. In an age largely driven by the commercial, Alison hopes that her practice will motivate change and social good.",
    "comments": "Please use jpeg titled, 'joinme' as the first image if possible. I have a vimeo link of my video since the file size is too large https://vimeo.com/manage/videos/1077970403 let me know if that won't work. \n\nI also have a publication link: https://heyzine.com/flip-book/076dc0ef0a.html"
  },
  {
    "index": "6",
    "start_time": "4/23/25 11:10:18",
    "completion_time": "4/23/25 11:36:15",
    "email": "shovemiyap@ocadu.ca",
    "name": "Shovemiya Packiyanathan",
    "modified_time": "",
    "preferred_name": "Shovemiya Packiayanathan",
    "pronouns": "she/her",
    "website": "https://portfolio-pnckrhv.format.com/shovemiya-designs",
    "social_media": "LinkedIn: https://www.linkedin.com/in/shovemiya/\n",
    "work_email": "shovemiyap@gmail.com",
    "project_name": "",
    "project_description": "Fractured Frames is a multidisciplinary thesis project that explores the portrayal of female archetypes in neo-noir cinema from the 1970s to the 2000s. Through a graphic design lens, the project investigates how visual and narrative techniques in these films construct, mediate, and often aestheticize female suffering. The work critically examines how these portrayals reinforce or subvert cultural perceptions of gender, empathy, and power. This project aims to uncover the recurring roles women inhabit in neo-noir—such as the femme fatale, the victim, the damsel in distress, and the survivor—and how these archetypes evolve across decades. It reflects on how their suffering is stylized and framed within the cinematic language of darkness, ambiguity, and psychological tension characteristic of the genre.",
    "bio": "Hi! I’m Shovemiya Packiyanathan, a graphic designer passionate about creating work through photography and design. Whether crafting visuals or capturing moments, I aim to create work that connects and inspires. I’m always eager to explore new ideas, take on exciting challenges, and showcase my unique perspective. I’d love for you to explore my work and see where creativity takes us!",
    "comments": ""
  },
  {
    "index": "7",
    "start_time": "4/23/25 18:28:11",
    "completion_time": "4/23/25 18:49:11",
    "email": "yas.hassanzadeh@ocadu.ca",
    "name": "Yas Hassanzadeh",
    "modified_time": "",
    "preferred_name": "Yas Zade",
    "pronouns": "she/her",
    "website": "https://yaszade.myportfolio.com/",
    "social_media": "Instagram: @yas.zade\nLinkedIn: Yas Hassanzadeh\n",
    "work_email": "yaszade.design@gmail.com",
    "project_name": "",
    "project_description": "My exhibition will be of a publication and an interactive exhibition diving into the story of a selected woman in science who faced prejudice all her life. The exhibit will showcase aspects of all the ways this prejudice was present in their life. The publication highlights the extraordinary journeys of ten pioneering women who broke barriers and reshaped the landscape of science. In fields traditionally dominated by men, these remarkable women faced discrimination, dismissal, and a persistent lack of recognition, yet they endured. Their stories are shared to honour their resilience, shed light on their achievements, and ensure their legacies are never forgotten. My intention with this project was to amplify the voices of women. ",
    "bio": "I’m a graphic designer with a strong curiosity for biology—an unlikely duo that fuels my creative process in unexpected ways. I enjoy exploring all facets of art, from analog techniques to photography and beyond. I thrive on a challenge and am constantly learning, driven in part by an admittedly bold (but well-placed) confidence that I can master any form of design I set my mind to.",
    "comments": "*my portfolio is under construction there's changes that need to be made so if it's possible to not make my post till at least the end of this week, I'd really appreciate it!"
  },
  {
    "index": "8",
    "start_time": "4/23/25 20:20:22",
    "completion_time": "4/23/25 20:37:30",
    "email": "liamkuzmahunt@ocadu.ca",
    "name": "Liam Kuzma-Hunt",
    "modified_time": "",
    "preferred_name": "Liam Kuzma-Hunt",
    "pronouns": "he/him",
    "website": "https://www.liamkuzmahunt.com",
    "social_media": "instagram @lkh_artndesigns\nTikTok @kuzmahuntdesigns",
    "work_email": "kuzmahuntl@gmail.com",
    "project_name": "",
    "project_description": "Much of my work is inspired by nature, music and self expression. Recently, I have been exploring inter-sensory associations between musical characteristics and the formal qualities of art and design through the production of a visual identity for a start up band based in Montreal. My design work often incorperates photographic practices as well as mixed media and illustration to produce works in the 2nd 3rd and 4th dimension.   ",
    "bio": "I am a Toronto based graphic designer/artist. My work is often inspired by nature, music, science and self-expression. Beginning my creative journey in traditional media arts I have since expanded into the realm of design working both in the digital and physical realm to produce a variety of design media. ",
    "comments": "these works I have uploaded are a small part of a larger thesis project creating a visual identity for a Montreal based start up band called Fleeting Colours. as part of this thesis I have also solely produced, filmed and edited a music video however, the file is too large to upload even after compression. I have provided the link to the video here: https://www.liamkuzmahunt.com/graphicdesigns/stay-fleeting-colours  \n"
  },
  {
    "index": "9",
    "start_time": "4/23/25 21:10:35",
    "completion_time": "4/23/25 23:30:41",
    "email": "sammilam@ocadu.ca",
    "name": "Sammi Lam",
    "modified_time": "",
    "preferred_name": "Sammi Lam",
    "pronouns": "she/her",
    "website": "sammilam.format.com/",
    "social_media": "LinkedIn: https://www.linkedin.com/in/lamsammi/\nInstagram: sheep2813\n",
    "work_email": "sammilamdesign@gmail.com",
    "project_name": "",
    "project_description": "Generation of Patterns investigates the psychological impact of patterns and uses them as a visual language through generative systems informed by journal documentation, interactive engagement, and creative exploration. Patterns are everywhere. They repeat to impose order, tell a narrative, reflect identity, create mood, and infinitely more. My process de-centralizes human subjectivity and prioritizes relationality ontology to question assumptions, embrace multistability, and redefine who and what design serves.   ",
    "bio": "Hi, I'm Sammi Lam (she/her)! I'm a passionate and curious designer who loves playing with various mediums and embracing constraints to produce new ways of design thinking. Through my work, I aim to uncover greater truths that open up unconventional possibilities and ideas that question norms and create meaningful conversations.",
    "comments": ""
  },
  {
    "index": "10",
    "start_time": "4/24/25 17:12:59",
    "completion_time": "4/24/25 17:17:38",
    "email": "etam@ocadu.ca",
    "name": "Emmit Tam",
    "modified_time": "",
    "preferred_name": "Emmit Tam",
    "pronouns": "he/him",
    "website": "www.emmittam.format.com",
    "social_media": "Instagram: @ekmt.designco\nClothing Instagram: @lonely.cmpny",
    "work_email": "emmit.tamm@gmail.com",
    "project_name": "Lonely Company / Brand Identity and Apparel Design",
    "project_description": "This project aims to address loneliness by creating a clothing brand that serves as a catalyst for human connection. The brand will encapsulate self-expression but will go beyond just apparel. The brand strives to be a symbol of belonging, encouraging individuals to share their stories and support others. The goal is to reconnect others with themselves and to others. \n\nClothing serves as a symbol of identity & unity, but the real impact comes from the community that forms around it. The brand will provide opportunities to express themselves, engage with themselves internally and with others, and provide a circle of support that values inclusivity, authenticity and emotional well-being.",
    "bio": "I’m a graphic designer and brand identity specialist passionate about creating visual systems that tell meaningful stories. My work focuses on building thoughtful brands, from concept to execution, with a particular interest in culture and minimal aesthetics. Through my clothing brand, Lonely Company, I explore the intersection of design and self-expression, using apparel as a canvas for ideas that connect and resonate.",
    "comments": ""
  },
  {
    "index": "11",
    "start_time": "4/24/25 17:54:16",
    "completion_time": "4/24/25 18:23:35",
    "email": "ellenh@ocadu.ca",
    "name": "Ellen Hur",
    "modified_time": "",
    "preferred_name": "Ayeong Hur",
    "pronouns": "she/her",
    "website": "https://portfolio-ellen.format.com/",
    "social_media": "Instagram: @ayd00_\n                 @ayexngg\nPortfolio: https://portfolio-ellen.format.com/",
    "work_email": "ayeongh0720@gmail.com",
    "project_name": "Sobar",
    "project_description": "“Finding the right balance”\n\nThis project focuses on designing a mobile app that merges the functionalities of a low-alcohol cocktail recipe app, a shopping feature for tools and drinks, and branding for a curated selection of low-alcohol cocktail products’ packaging designs. The goal is to provide users with a tool that offers low-alcohol cocktail recipes and educates them on mindful drinking habits by providing a seamless experience where users can discover, shop, and enjoy mindful drinking. ",
    "bio": "Ayeong Hur is a Toronto-based graphic designer passionate about every facet of graphic design, from branding and typography to UI/UX and packaging. She brings creativity, precision, and positive energy to her work. With a collaborative spirit and love for learning, she aims to create designs that connect people and ideas.",
    "comments": ""
  },
  {
    "index": "12",
    "start_time": "4/24/25 19:11:36",
    "completion_time": "4/24/25 19:58:21",
    "email": "emiliyav@ocadu.ca",
    "name": "Emiliya Volchenko",
    "modified_time": "",
    "preferred_name": "Emiliya Volchenko",
    "pronouns": "she/her;",
    "website": "https://whoismiaaa.myportfolio.com/",
    "social_media": "Instagram: @who.is.miaaa",
    "work_email": "who.is.miaaa@gmail.com",
    "project_name": "Reframing the Female Gaze: From Classical Art to Modern Media",
    "project_description": "The GradEx work begins with a question that has haunted the history of visual culture: Why do the same images of women, passive, perfected, and posed, continue to repeat across centuries? Tracing a visual timeline from 17th to 19th century academic and salon traditions to today’s beauty magazines and social media aesthetics, this body of work reveals how entrenched ideals of femininity continue to shape how women are seen and represented.\n\nGuided by feminist critique and research, the work includes artist books, posters, prints, and postcards. Using both traditional and digital techniques, gel print transfers, collage, and hand-crafted textures are layered with digital design tools to create reproductions that expose the visual patterns that have persisted over time. These reproductions are not mere copies, but reimaginings that question the authority and legacy of historical imagery.\n\nBy merging analogue and contemporary media, the work explores how reproduction techniques can both expose and resist inherited narratives. It is not only a critique, but an effort to reclaim space for alternative representations, creating images that are more truthful, human, and free. This is a call to see differently and move beyond the gaze that has defined women for far too long. Through this body of work, women’s stories and bodies are reclaimed and reimagined, not as objects, but as subjects of their own power.",
    "bio": "Emiliya Volchenko is a Toronto-based graphic designer, visual artist, and photographer. Her practice blends traditional and digital media, rooted in storytelling, emotion, and concept-driven design. She explores themes of femininity, mental health, and identity through editorial design, experimental typography, photography, and interactive media to craft compelling visual narratives.",
    "comments": ""
  },
  {
    "index": "13",
    "start_time": "4/25/25 0:33:32",
    "completion_time": "4/25/25 0:51:14",
    "email": "ava.cvitkovich@ocadu.ca",
    "name": "Ava Cvitkovich",
    "modified_time": "",
    "preferred_name": "Ava Cvit",
    "pronouns": "she/her;",
    "website": "https://avacvit.format.com/work",
    "social_media": "Instagram: @avacvit",
    "work_email": "avacvit.design@gmail.com",
    "project_name": "Foreign Forms - Research Publication. Fallen Branches - Data Visualization. Sororal Itineraries - Editorial",
    "project_description": "I focus on the built environment, memory, and our climate within my work. I use these ideas to communicate how consequential and vital they are within our society, to maintain and protect aspects of the natural within a manufactured world. \n\nForeign Forms is a research publication that studies memory within architecture. It explores structures that have found ways of storing, destroying, or unintentionally preserving memory within the initial space. Foreign Forms intends to create a way to regard collective, personal, and historical memory within architecture—how places form meaning without requiring ornamental features or famous recognition, but instead how communities and individuals find meaning within a building.\n\nFallen Branches explores turning data into a physical artifact representing the increase/decrease in forest area between 1990 and 2020. Each branch represents a country that has either developed positive or negative transformations. \n\nSororal travel itineraries explore creating guides that connect to Sororal’s mission of advocating gender equality and combating gender-based violence through travel. I developed guides that communicated their ethos of familiarity and togetherness with playful colours, illustrations and layouts.",
    "bio": "I view graphic design as a tool to share and understand the world around me. I practice editorial, print, and illustrative design, focusing on simplicity, community, and self. Our environment and sustainability are factors that I hold close to my design process and philosophy. They inspire me to slow down and be more thoughtful in my approach to life. ",
    "comments": ""
  },
  {
    "index": "14",
    "start_time": "4/25/25 1:48:31",
    "completion_time": "4/25/25 2:00:10",
    "email": "ntodd@ocadu.ca",
    "name": "N'Dasa Todd",
    "modified_time": "",
    "preferred_name": "N'Dasa Todd",
    "pronouns": "she/her;",
    "website": "https://ndasa-todd.format.com",
    "social_media": "Instagram: @endaysah\nLinkedIn: N'Dasa Todd",
    "work_email": "ndasatodd@gmail.com",
    "project_name": "Regarding The Aging Female",
    "project_description": "Regarding The Aging Female is a physical archive that captures evidence of our culture’s collective attitude towards aging women*. Disseminated across a current total of 40 booklets, it collects physical and digital instances of opinions and behaviours directed towards aging women and their bodies. The books are categorized into various body parts, presenting quotes, advertisements, social media posts, products, lyrics, etc. that highlight how we react to an aging, fem(ale)* anatomy. Come see part 2 at GradEx! \n\n*fem(ale)/women includes the shared experience of cis, afab trans, non-binary, agender/gender-nonconforming, and gender-variant people! ",
    "bio": "Hi! I’m N’Dasa (pronounced en-day-sah) Todd, a GTA-based graphic designer interested in ephemera, archives, and publications. Being interested in visualizing archival data, a lot of my design collects instances of culture, identity, and memories, culminating in physical pieces that provide evidence of being. I hope to continue creating work that immortalizes the people and environments around me!",
    "comments": ""
  },
  {
    "index": "15",
    "start_time": "4/25/25 14:11:16",
    "completion_time": "4/25/25 14:12:30",
    "email": "kirthigat@ocadu.ca",
    "name": "Kirthiga Thevakumar",
    "modified_time": "",
    "preferred_name": "Kirthi Thevakumar ",
    "pronouns": "she/her;",
    "website": "https://kirthispace.com/",
    "social_media": "Are.na: https://www.are.na/kirthi-3/channels\nInstagram: https://www.instagram.com/kirthis_space/ \n",
    "work_email": "kirthi.thevakumar@gmail.com",
    "project_name": "Documentary film: மீள்தன்மை/Mīḷtaṉmai Website: Items of The Tamil Diaspora",
    "project_description": "மீள்தன்மை / Mīḷtaṉmai is a documentary that traces the journey of one Eelam Tamil family in Canada, offering a poignant reflection on the resilience, strength, and enduring spirit of the wider Eelam Tamil community in diaspora.\nItems of the Tamil Diaspora is an online archive of everyday objects commonly found in Tamil households. ",
    "bio": "Kirthi is an Eelam Tamil-Canadian graphic designer who uses design as a tool to navigate her sense of self. Many of her projects are about her Tamil identity, but her interests lie in researching many different cultures and histories. ",
    "comments": ""
  },
  {
    "index": "16",
    "start_time": "4/25/25 15:06:57",
    "completion_time": "4/25/25 15:38:52",
    "email": "alexiacantore@ocadu.ca",
    "name": "Alexia Cantore",
    "modified_time": "",
    "preferred_name": "Alexia Cantore",
    "pronouns": "she/her;",
    "website": "https://alexiacantore.myportfolio.com",
    "social_media": "Instagram: @alexiacantore \nLinked In: https://ca.linkedin.com/in/alexiacantore\nGradEx E-Portfolio: https://eportfolio.ocadu.ca/profile/details/96e4f6c4-0822-4481-8ae7-5d0242e10742#profile",
    "work_email": "alexiacantoredesigns@gmail.com",
    "project_name": "Too Much Immersive Exhibition ",
    "project_description": "Understanding graphic overload and the overwhelming feeling of being consistently bombarded with graphic noise resulting in visual exhaustion. The immersive space is for you to explore so I will not give too much away, be there in person to feel the full experience. ",
    "bio": "I am consistently refining my creative mindset, growing as a graphic communicator. I have always been driven by a passion for innovative design solutions that enhance problem solving. I strive to enhance refined, well-crafted designs that problem solve and enhance experiences by connecting with people and space.",
    "comments": "Come find me and my work in room 654 on the 6th floor of the main building at 100 Mc Caul street to feel the full experience. "
  },
  {
    "index": "17",
    "start_time": "4/25/25 15:38:57",
    "completion_time": "4/25/25 16:02:38",
    "email": "alexiacantore@ocadu.ca",
    "name": "Alexia Cantore",
    "modified_time": "",
    "preferred_name": "Alexia Cantore and Jacob Steer Kagayama",
    "pronouns": "she/her;he/him;",
    "website": "https://alexiacantore.myportfolio.com    AND   https://jsk.format.com",
    "social_media": "Instagram: @alexiacantore @kagayama.js\nLinkedIn:  https://ca.linkedin.com/in/alexiacantore   AND   https://www.linkedin.com/in/jacob-steer-kagayama-93b06534b/",
    "work_email": "alexiacantoredesigns@gmail.com    AND   jacobktsteer@gmail.com",
    "project_name": "Hum. Helping U move ",
    "project_description": "Hum is a collaborative packaging design and branding project that focuses on designing for the elderly to promote healthy living. Hum is dedicated to providing products that promote healthy mobility and active living. through high contrast colours, highly legible text, and refined graphics.  The product themselves designed for providing support and mobility aids proving the importance of exercising safely. Hum also includes a partnership with an organization #oldernotover where $1 spent on the product is donated back to reducing stereotypes about aging life. ",
    "bio": "Jacob and Alexia work collaboratively to find design solutions that are easily digestible, approachable, fun, and educational. The goal is to create inclusive design that proves the importance of designing for all. By looking to promote healthy living, this caters to a wide demographic of people also contributing to a global enterprise. ",
    "comments": "Find us and our work in room 654 on the 6th floor of OCAD U's main building at 100 McCaul street. "
  },
  {
    "index": "18",
    "start_time": "4/25/25 18:48:03",
    "completion_time": "4/25/25 18:54:16",
    "email": "nikhieltejani@ocadu.ca",
    "name": "Nikhiel Tejani",
    "modified_time": "",
    "preferred_name": "Nikhiel Tejani",
    "pronouns": "he/him;",
    "website": "https://nikhieltejani.myportfolio.com/work",
    "social_media": "instagram: @nikhiel.kt",
    "work_email": "nikhiel37@gmail.com",
    "project_name": "Walking Toronto: Parks and Greenspaces",
    "project_description": "Walking Toronto was an experiment created to explore and gain knowledge on the Toronto parks and green spaces to help further connect myself and those who live in the city to nature. The project follows 10 walks, each at different parks, that are within an hour or less commute from OCAD. Using the theories of psychogeography and the Dérive to guide my practice and research, I have created 10 posters that follow each walk and the route that was taken. Allowing for others to see what each space has to offer, or even follow the route themselves.  ",
    "bio": "I consider myself an all around designer who has a love for sports, nature, and people. These aspects, along with the places I've lived, (Vancouver, Southern California, and now Toronto) all inform me as a designer and person.",
    "comments": "na"
  },
  {
    "index": "19",
    "start_time": "4/25/25 18:56:23",
    "completion_time": "4/25/25 19:37:19",
    "email": "taleatambakos@ocadu.ca",
    "name": "Talea Tambakos",
    "modified_time": "",
    "preferred_name": "Talea Tambakos",
    "pronouns": "she/her;",
    "website": "https://taleatambakos.myportfolio.com",
    "social_media": "Instagram: @taleatambakos",
    "work_email": "taleatambakos@gmail.com",
    "project_name": "Graphic Design, Drawing and Painting",
    "project_description": "***I have many different projects that are unrelated as I am not in thesis, feel free to highlight only a few or them all, completely up to the format of this website. I have provided short descriptions for each, labeled in relation to the image names***\n\nWork 1: Beyond the Frame is a collection of fifteen essays written by Talea Tambakos. Representing her evolution in design and academic critical discourse, all pieces are dated and ordered chronologically to invite the reader to observe improvements, notice mistakes, and most importantly, learn something new.\n\nWork 2: Design for Cannabis is a three-part publication series that explores the influence of design within the cannabis industry. Through Archive, Annotated Bibliography, and SketchUp for Interior Design, the series highlights the importance of design within a competitive market.\n\nWork 3: Untitled-1 becomes a memoir of Talea’s arts and design education within the past four years. By combining the technical appearance of the Photoshop window with a painted medium, this piece exhibits her love for both digital and traditional art and design.\n\nWork 4: Echos of Home is a self-reflective piece of Talea’s memories, nostalgia for childhood, and a longing for the happiness she felt while visiting her family’s home in Spathes, Greece.\n\nWork 5: This poster pair highlights Talea’s passion for examining the forms of human anatomy through detailed and scientifically labelled illustrations of the human skeletal and musculoskeletal systems.",
    "bio": "Talea Tambakos is a Toronto-based graphic designer & artist.\nHer experience in both digital & traditional forms of art & design works to express her interest in typography, image manipulation, and illustration through multiple mediums. With a passion for studying the forms of human anatomy and themes within art historical discourse, her work remains diverse in subject yet visually and thematically intriguing.",
    "comments": "Not sure the context of where the picture of me will appear. You can choose whichever one you think looks better for the context :)"
  },
  {
    "index": "20",
    "start_time": "4/25/25 20:05:09",
    "completion_time": "4/25/25 20:19:20",
    "email": "simarkaurn@ocadu.ca",
    "name": "Simar Kaur",
    "modified_time": "",
    "preferred_name": "Simar Kaur",
    "pronouns": "she/her;",
    "website": "",
    "social_media": "",
    "work_email": "Simar03kaur@gmail.com",
    "project_name": "IDCO ",
    "project_description": "IDCO is a thesis project that critiques the commodification of identity in consumer culture through satire, irony, and exaggeration. It explores how products are no longer just objects, but are marketed as essential parts of who we are. At its core is a fictional e-commerce platform selling pre-packaged identities—because why go through self-discovery when you can just subscribe? The experience includes a personality quiz that strips away even the illusion of choice by telling users exactly who they should be, and an over-the-top brand guideline that explains the fabricated importance of IDCO’s logo and tone. Through this digital and physical ecosystem, IDCO invites viewers to question how consumerism turns meaningful experiences into marketable aesthetics—and what that means for our sense of self.\n\nYou can visit the website here: http://idco.space/",
    "bio": "Simar Kaur is a graphic designer who graduated in 2025 from OCAD University in Toronto. With a natural curiosity and an eagerness to learn, she approaches each project with an open mind, continuously evolving her design style to meet the specific needs of every challenge. Rather than adhering to a fixed aesthetic, she embraces flexibility, blending various techniques and concepts to create designs that are both functional and visually engaging.\n\nFocused on the balance between form and function, Simar aims to craft designs that not only communicate a clear message but do so in a compelling and aesthetically pleasing way. Her work is rooted in the belief that effective visual communication transcends style, instead marrying purpose with beauty. Through each project, she strives to create meaningful connections between the audience and the message, ultimately enhancing the experience through thoughtful design.\n",
    "comments": ""
  },
  {
    "index": "21",
    "start_time": "4/25/25 20:49:56",
    "completion_time": "4/25/25 20:57:28",
    "email": "sheng.kang.he@ocadu.ca",
    "name": "Sheng Kang He",
    "modified_time": "",
    "preferred_name": "Sheng Kang He",
    "pronouns": "he/him;",
    "website": "https://sheng-my-portfolio.framer.website/",
    "social_media": "My portfolio website: https://sheng-my-portfolio.framer.website/",
    "work_email": "designs.sheng@ocadu.ca",
    "project_name": "Packaging Design + Branding Design",
    "project_description": "My works blends clarity, function, and creativity, expressed through a style rooted in minimalism and innovation.",
    "bio": "I’m a graphic designer specializing in brand identity and packaging design, with a focus on minimalist aesthetics. I’m passionate about creating designs that enhance the user experience and embody the spirit of \"design for good\".",
    "comments": "Explore my portfolio website to see more of my design process and creative approach！"
  },
  {
    "index": "22",
    "start_time": "4/25/25 21:59:52",
    "completion_time": "4/25/25 22:24:00",
    "email": "dlavrentiev@ocadu.ca",
    "name": "Dmytro Lavrentiev",
    "modified_time": "",
    "preferred_name": "Dmytro 'Dima' Lavrentiev",
    "pronouns": "he/him;",
    "website": "dimagd.com",
    "social_media": "https://dimagd.com/\nhttps://www.are.na/dima-lavrentiev-h2zqwqwt_v8/channels\nhttps://www.instagram.com/dima_gd_/\nhttps://www.linkedin.com/in/dlavrentiev/",
    "work_email": "dlavrentievgraphics@gmail.com",
    "project_name": "My Hometown is Under Attack & Ruïns (Installation, Animation, Poster Design)",
    "project_description": "My Hometown is Under Attack\nThis project was created specifically for GradEx 110. It expands upon my earlier analog animation project, Ruïns, which depicted the destruction of buildings in Ukraine caused by Russian Forces. Through this work, I aim to capture the broader devastation of the ongoing Russian-Ukrainian War. As headlines and social media coverage of the war fade from public attention, this project serves as a poignant reminder that the war—and its human cost—continue.\nThese animations are not solely about destroyed structures or their material loss; they are a tribute to the people who once brought these places to life. This made the recent attacks on my hometown of Sumy on April 13th and 18th feel even more personal, reigniting deep anger and an urgent need to speak out. GradEx provides a powerful platform to share this message and honour those affected.\nPlease visit my My Hometown is Under Attack display to learn more and reflect with me.",
    "bio": "Dima (he/him) is a Toronto-based graphic designer with experience in print media, brand identity, packaging design, and social media design. His recent work has focused on topics such as urban history and preservation, culture, and social justice. Dima holds a Bachelor of Design from OCAD University in Toronto, ON, and a diploma in Business Administration from the University of Regina.",
    "comments": "For the image on the first slide of the carousel, you can use the PNG, and the second slide can be a video. Also, for the website, can I please email you GIFS of my animations because that's how they are meant to be displayed?"
  },
  {
    "index": "23",
    "start_time": "4/25/25 22:22:22",
    "completion_time": "4/25/25 22:27:45",
    "email": "simrankhanna@ocadu.ca",
    "name": "Simran Khanna",
    "modified_time": "",
    "preferred_name": "Simran Khanna",
    "pronouns": "she/her;",
    "website": "https://simrankhannaportfolio.framer.website/",
    "social_media": "LinkedIn: http://linkedin.com/in/simran-khanna-00573922a",
    "work_email": "simran.khanna484@gmail.com",
    "project_name": "Illusion of Choice",
    "project_description": "“The Illusion of Choice” critically examines digital consent manipulation through everyday interfaces like CAPTCHAs, user agreements, and web cookies. Using satirical mixed-media animations, an intentionally frustrating interactive website, and a provocative poster, this project reveals the hidden coercion behind digital consent, encouraging users to question their online interactions and perceived autonomy. \n\n✦ Artifact 1: Animation + Accordion Zine\n\"A Cookie’s Journey\" is a looping mixed-media animation that follows a curious web cookie tracking user data across the internet. The accompanying accordion zine, packaged inside a cookie jar, unfolds the hidden layers of digital tracking in a playful, bilingual narrative.\n\n✦ Artifact 2: Interactive Website\n\"Illusion of Choice\" is an interactive website that recreates frustrating digital consent experiences through endless pop-ups, unsolvable CAPTCHAs, frustrating user agreements, and manipulative interfaces. It challenges users to confront the deceptive designs that pressure them into agreeing without real choice. \n\nhttps://simrankhanna484.github.io/illusion-of-choice/ \n\n✦ Artifact 3: Poster\nThe \"Illusion of Choice\" poster visually captures the core themes of the project. Mimicking digital cookies, it removes interactivity, forcing viewers to recognize the static, unavoidable nature of online consent and question the illusion of agency in digital spaces.\n",
    "bio": "Simran Khanna is a Toronto-based graphic designer and multimedia artist whose work explores digital culture through interactive websites and mixed-media storytelling. Drawing from design innovation and visual satire, Simran’s practice creatively critiques contemporary digital experiences, inviting audiences to rethink their relationship with technology and the choices they encounter online.\n\nhttps://simrankhanna484.github.io/illusion-of-choice/ ",
    "comments": ""
  },
  {
    "index": "24",
    "start_time": "4/25/25 22:26:37",
    "completion_time": "4/25/25 22:37:21",
    "email": "ruonc@ocadu.ca",
    "name": "Ruon Hee Chon",
    "modified_time": "",
    "preferred_name": "Ruon Hee Chon",
    "pronouns": "she/her;",
    "website": "https://yunniejrh.wixsite.com/ruonhee-s-portfolio",
    "social_media": "Instagram: @v.uni_ine.v\nYoutube: @yolhee4881",
    "work_email": "yunniejrh@gmail.com",
    "project_name": "Najeonchilgi Meets Canada – A Fusion of Cultural Storytelling",
    "project_description": "This project explores the fusion of two distinct cultural identities—Korean najeonchilgi (mother-of-pearl inlay) and Canadian landscapes—through visual storytelling. Najeonchilgi is a traditional Korean craft known for its detailed floral patterns, symmetrical layouts, and iridescent textures set against black lacquered backgrounds. I reinterpreted this heritage technique digitally, applying its elements to Canadian landmarks like the CN Tower, Parliament Hill, and the Rocky Mountains.\n\nAs a Korean designer living in Canada, I aimed to reflect my personal experience of navigating two cultures. The project began with a series of digital posters that visually combine Korean decorative motifs with Canadian symbols. These posters were designed with symmetry and pastel tones on black backgrounds, evoking the elegance of najeonchilgi while introducing Canadian identity through landscapes and the beaver, Canada’s national animal.\n\nI printed the posters to explore materiality and tactility and created a handmade wooden box decorated in the same style. This box served as a tangible artifact, adding depth and texture to the project. The beaver character appears across both digital and physical outcomes, engaging in playful activities that connect cultural symbols with everyday life.\n\nThrough this work, I aimed to create a meaningful dialogue between Korean tradition and Canadian culture, showing how design can bridge histories and geographies in new and creative ways.",
    "bio": "RuonHee Chon is a Korean graphic designer based in Toronto, Canada. Her work explores cultural storytelling by blending Korean traditional craft with modern design. Inspired by najeonchilgi (mother-of-pearl inlay), she creates visual experiences that connect her heritage with contemporary landscapes, focusing on themes of identity, place, and cultural fusion.",
    "comments": ""
  },
  {
    "index": "25",
    "start_time": "4/25/25 23:02:18",
    "completion_time": "4/25/25 23:31:27",
    "email": "samanthaliu@ocadu.ca",
    "name": "Samantha Liu",
    "modified_time": "",
    "preferred_name": "Samantha Liu",
    "pronouns": "she/her;",
    "website": "https://samanthaliu.format.com/",
    "social_media": "instagram: @bitters.cafe",
    "work_email": "samanthaliu.design@gmail.com",
    "project_name": "Bitter's Beauty",
    "project_description": "Bitter's Beauty is a love letter to cosmetic branding. This cafe-themed brand identity captures everything I love about cosmetics, from playful mascot design to unique scent names. This brand features Bitter, a clumsy yet hardworking mascot, four travel-sized products inspired by Asian desserts, and a sleek sleeve box to hold it all together. Don’t miss the charming logo reveal that brings Bitter’s personality to life, all designed with your busy lifestyle in mind.",
    "bio": "Hi there! I’m Samantha Liu, a creative storyteller with a focus on visual design and illustration. I enjoy bringing simple concepts to life through brand identity, motion graphics, and packaging. I always aim to make my work fresh and full of personality. I thrive on connecting with people and collaborating with a team. When I’m not designing, you can probably find me making a blueberry latte.",
    "comments": "Come by Samantha's table for a free postcard!"
  },
  {
    "index": "26",
    "start_time": "4/25/25 23:29:55",
    "completion_time": "4/25/25 23:31:28",
    "email": "francineguilalas@ocadu.ca",
    "name": "Francine Guilalas",
    "modified_time": "",
    "preferred_name": "Francine Guilalas",
    "pronouns": "she/they;",
    "website": "https://planet-fran.format.com",
    "social_media": "Instagram: @planetfran/@fwancine\nLinkedIn: Francine Guilalas",
    "work_email": "guilalasfrancine@gmail.com",
    "project_name": "in search of",
    "project_description": "\"In Search Of\" is a culminating body of work that explores the damsel-in-distress trope and its impact on missing persons cases through its role as the ideal victim. Francine's video essay, \"Stitching the Invisible\", explains this connection and documents her process of cross-stitching a portrait of Kevin Lim, an act that deepened her understanding of the trope’s impact. Accompanying the video and cross-stitch portrait are two books: one shares the same title as the video and serves as its full transcription; the other, \"The Solved/The Unsolved\", contrasts Canada’s solved and unsolved missing persons cases to highlight the real consequences of idealized victimhood.",
    "bio": "Francine Guilalas is a graphic designer who's work is driven by a deep interest in how stories take shape through data and design. She often draw from archives, cultural references, and systems of information to create pieces that invite people to look a little closer. For Francine, design is the ultimate tool for storytelling and critique. Her work has been displayed at Ada Slaight Gallery for \"Project: Visual Explainer (2022)\", and the Fall Term Thesis exhibit (2024).",
    "comments": ""
  },
  {
    "index": "27",
    "start_time": "4/25/25 23:43:28",
    "completion_time": "4/25/25 23:48:56",
    "email": "jiyoung.kim@ocadu.ca",
    "name": "Jiyoung Kim",
    "modified_time": "",
    "preferred_name": "Ellie Jiyoung Kim",
    "pronouns": "she/her;",
    "website": "https://elliejiyoungkim.myportfolio.com",
    "social_media": "",
    "work_email": "gim.j.young@gmail.com",
    "project_name": "Human-Driven Climate Change",
    "project_description": "\"Human-Driven Climate Change\" visualizes the measurable impacts of human activities on the environment through datasets like arctic sea ice loss, global temperature rise, sea level increase, and atmospheric CO₂ concentration. The work translates scientific data into accessible visuals emphasizing the urgency of action.",
    "bio": "Ellie Jiyoung Kim is a graphic designer based in Toronto who specializes in data visualization. Drawing from her science background, she creates clear, engaging visuals that make complex topics easier to understand and connect with.",
    "comments": "I’m wondering if it would be possible to resubmit images of my work. I had to submit it before I was fully satisfied due to the deadline, but I feel that it doesn’t reflect the quality of my work.... I would really appreciate the chance to upload an updated version if possible. I will be able to send the new version right after this weekend. Thank you for considering this request.\n"
  },
  {
    "index": "28",
    "start_time": "4/25/25 23:35:24",
    "completion_time": "4/25/25 23:49:49",
    "email": "jacobsteer@ocadu.ca",
    "name": "Jacob Steer",
    "modified_time": "",
    "preferred_name": "Jacob Steer Kagayama",
    "pronouns": "he/him;",
    "website": "jsk.format.com ",
    "social_media": "Instagram: @kagayama.js\nYouTube: https://www.youtube.com/@jacobsteerkagayama \nLinkedIn: https://www.linkedin.com/in/jacob-steer-kagayama-93b06534b/ ",
    "work_email": "jacobktsteer@gmail.com",
    "project_name": "Observation Station",
    "project_description": "Welcome to Observation Station, the world of graphic design through my eyes. Observation Station is a collection of publications based on the idea of bringing a conscious awareness to the active vehicle of communication graphic design is. Each of the publications allows you to step back and observe the designed world around you, reminding you how much is designed for humans by humans just like you.  ",
    "bio": "Hi! I am Jacob, a graphic designer based in Toronto, with a speciality in editorial and publication design. I love and am constantly looking at the ever-growing graphic world around me to push myself to create the next best thing and become a more dynamic and efficient designer. ",
    "comments": "Hi! Thank you so much for doing this :) I know Alexia Cantore submitted a form earlier with a collaborative project we did together (HUM Packaing Design). Not sure if it's possible but if we could be posted close together that would be greatly appreciated. Thanks again! "
  },
  {
    "index": "29",
    "start_time": "4/25/25 23:23:02",
    "completion_time": "4/25/25 23:50:09",
    "email": "dwanigasuriya@ocadu.ca",
    "name": "Delusha Wanigasuriya",
    "modified_time": "",
    "preferred_name": "Delusha Wanigasuriya",
    "pronouns": "she/her;",
    "website": "https://dwanigasuriya.myportfolio.com/",
    "social_media": "Instagram: @dezignedbydelusha\nLinkedIn: @delushawanigasuriya",
    "work_email": "delushaxi16@gmail.com",
    "project_name": "1. Zestyra Kombucha- Package Design 2. How to Personal Shop: A Survival Guide- PC Express Edition- Book Design 3. SMISKI: OCADU Series: Package Design",
    "project_description": "Zestyra Kombucha: Created for Packaging Design 2: Design for Good, Zestyra Kombucha, a proudly all-Canadian brand crafted with only natural and organic ingredients grown in this country. More than just a refreshing and healthy beverage, Zestyra embodies a 'Design for Good' ethos, inviting consumers to join the 'Buy Canadian Movement' and actively support our nation amidst global events. Zestyra Kombucha tells the stories of local Ontario farmers and their impacts in Ontario's agriculture, sharing their story on each of our bottles with the produce and herbs they are most known for.\n\nHow to Personal Shop: A Survival Guide- PC Express Edition: Created for Editorial Design: Contemp Issu: Labour, this book contains a funny take on personal shopping through Loblaws stores. It contains a step by step guide on how to complete an order, with illustrations of fruits reenacting the tasks. This book can transform the mundane task of personal shopping into an entertaining adventure, offering both practical guidance and a much-needed dose of humor for anyone who's ever worked as a personal shopper. \n\nSMISKI: OCADU Series: Being an extension off of Editorial Design: Contemp Issu: Bootleg, this special Smiski packaging showcases a creative collaboration with OCAD University (OCAD U). Taking the beloved Japanese blind box phenomenon to a fresh, local level, this 'OCAD U Series' playfully reimagines the lives of OCAD U students through the charmingly quirky Smiski figures and their packaging.",
    "bio": "Delusha Wanigasuriya embraces the challenges of creating diverse art through various mediums and exploring innovative approaches. Growing up in Toronto's Regent Park, she was surrounded by extensive artwork, which inspired her to create her own. She enjoys creating artwork that has meaning behind it and expressing herself as a designer.",
    "comments": ""
  },
  {
    "index": "30",
    "start_time": "4/25/25 23:35:02",
    "completion_time": "4/25/25 23:55:11",
    "email": "nandinigandhi@ocadu.ca",
    "name": "Nandini Gandhi",
    "modified_time": "",
    "preferred_name": "Nandini Gandhi",
    "pronouns": "she/her;",
    "website": "http://www.nandinigandhi.com/",
    "social_media": "Arena: https://www.are.na/nandini-gandhi/channels\nInstagram: @nandini.gandhii",
    "work_email": "nandinigandhi@ocadu.ca",
    "project_name": "Seeing Sound - A Visual Simulation of Synesthesia",
    "project_description": "This project simulates chromesthesia, a form of synesthesia where sound involuntarily evokes color, movement, and shape. Through real-time microphone input and audio analysis, the installation transforms live sound into visual form—allowing viewers to experience a sensory crossover that is usually internal and deeply personal. Color becomes responsive, fluid, and alive, shaped by the pitch, intensity, and complexity of surrounding sounds. Silence erases the image; noise gives it form.\n\nBy merging code with perception, this simulation offers a glimpse into a different way of sensing the world—where the boundary between hearing and seeing dissolves. It invites participants to consider how others experience reality, and how technology and design can bridge gaps in understanding what it means to feel, to sense, and to be. Graphic design is all about visual communication so in the end, I hope this doesn’t just simulate chromesthesia, I hope it creates a moment of empathy. A chance to see sound, not just hear it.",
    "bio": "Hi, I'm Nandini! As a designer, my focus is on creating meaningful and impactful visual experiences through visual communication design, anchored in storytelling. My approach combines research, experimentation, and attention to detail, ensuring that my work is both functional and visually compelling. I am particularly drawn to the intersection of traditional design principles and emerging technologies, embracing innovation while respecting the foundations of design.",
    "comments": "I think the video is better at representing the project!"
  },
  {
    "index": "31",
    "start_time": "4/25/25 23:56:46",
    "completion_time": "4/25/25 23:56:55",
    "email": "danakeselman@ocadu.ca",
    "name": "Dana Keselman",
    "modified_time": "",
    "preferred_name": "Dana Keselman",
    "pronouns": "she/her;",
    "website": "https://danakeselman.cargo.site/",
    "social_media": "Are.na: https://www.are.na/dana-keselman/channels",
    "work_email": "danakeselman@gmail.com",
    "project_name": "see the trees / collection of publications, series of workshops and website",
    "project_description": "“see the trees” is a collection of design artifacts that emerged from workshops focused on unlearning plant blindness, the phenomenon where humans don’t notice plants and trees around them and instead see them as a background or “stage setting” for animal activity. Each workshop is unique and follows different methods of making the design artifact, including collaborating on the design, each person arranging the order of the spreads and an asynchronous version. Together, the workshops were compiled into a toolkit that is available for everyone to follow at home and try facilitating their own workshop on unlearning plant blindness!",
    "bio": "Dana Keselman is a graphic designer based in Tkaronto. Her work centres around humans’ relationship with nature and involves the community in learning together. Dana has exhibited work at the OCADU Open House (2024), Final Thesis Exhibition at the Ada Slaight Gallery (2024) and now the 110th Annual Gradex! ",
    "comments": ""
  },
  {
    "index": "32",
    "start_time": "4/25/25 23:20:54",
    "completion_time": "4/25/25 23:58:24",
    "email": "marias@ocadu.ca",
    "name": "Maria San Martin Celi",
    "modified_time": "",
    "preferred_name": "Maria San Martin Celi",
    "pronouns": "she/her;",
    "website": "mariasanmartinceli.format.com",
    "social_media": "LinkedIn: www.linkedin.com/in/maria-san-martin-celi-5a7905323",
    "work_email": "mariasanmartinceli@gmail.com",
    "project_name": "\"Dear Toronto,\" and \"Biomimetic Design\"",
    "project_description": "'Dear Toronto,' is a five-part video series that uses kinetic typography, illustration, and filmed footage to explore how nature impacts urban lifestyles in Toronto. This project began with a concern for rising numbers in loneliness, mental health challenges and a need for engagement within local communities. The series unfolds as a personal letter written to Toronto, expressing a \n\n'Biomimetic Design' is a web-based project investigating the intersection of graphic design and biomimicry, and how looking towards nature's already-found solutions offers an important perspective to visual communication. The site uses elements of pattern, colour, shape and sound to explore the systems of communication found in nature that are reflected in graphic design. This project posed the challenge of translating an ecosystem into an interface, allowing for an interactive archive that mirrors the complexity and harmony of the natural world.",
    "bio": "I'm a graphic designer specializing in motion, illustration and print. I am inspired by how the natural world intertwines with human lives and I strive to use design as a tool for meaningful storytelling in my explorations. Through my work, I aim to create personal and emotional connections with others.",
    "comments": "Hi! So my thesis consisted of two separate projects though if you need to use only one title (or put two separate titles) to fit the format of the post, please use \"Dear Toronto,\" first as it is my main thesis project. But \"Dear Toronto,\" and \"Biomimetic Design\" are two different projects. Pls let me know if theres any issues w/ aspect ratio as well. Thank you!"
  },
  {
    "index": "33",
    "start_time": "4/25/25 23:59:09",
    "completion_time": "4/25/25 23:59:35",
    "email": "flora.tam@ocadu.ca",
    "name": "Flora Tam",
    "modified_time": "",
    "preferred_name": "Flora Tam",
    "pronouns": "she/her;",
    "website": "floratam.ca",
    "social_media": "Instagram: @1amest",
    "work_email": "floratam02@gmail.com",
    "project_name": "Ceramics (1 - gateway, 2 - laptop, 3 - flasks), Prints/Printmaking (4 - didn't i? 5 - cigar-rat?), Photography/Zine (6 - image collector)",
    "project_description": "CERAMICS\n\nWORK 1 - gateway, 2024\nstoneware, glaze\n\ndescription for WORK 1\nGateway is my attempt at creating something that is both beautiful yet functional - it is sculpture and shelf at the same time. While the front is adorned with mirrored, yet not-exactly-symmetrical motifs, the back features space for shelving for your smallest, most prized possessions (a business at the front, party in the back type deal).\n\nWORK 2 - laptop, 2024\nstoneware, underglaze, glaze, ceramic decals\n\ndescription for WORK 2\nLaptop is simply a recreation of my everyday laptop that I have used throughout my entire undergrad, in ceramic form. \n\nWORK 3 - flasks, 2024 - 2025\nslip cast stoneware, glaze, ceramic decals\n\ndescription for WORK 3\nStarting from the same form over and over again, I employ a variety of surface techniques and designs to see the many different ways in which I can transform this singular object, creating my collection of Flasks that feel like they belong in the same family, but each have their own voice, remaining distinct from each other. \n____________\n\nPRINTMAKING\n\nWORK 4 - didn't i?, 2024 \nintaglio print\n\nWORK 5 - cigar-rat?, 2024\nlinoleum relief print\n\ndescription for WORK 4 + 5\nIn my printmaking practice, I am constantly drawn to depicting animals inspired by my online browsing habits. I take inspiration from memes that juxtapose cute and funny animal pictures with ironic text captions to create whole new layers of meaning and context.\n____________\n\nPHOTOGRAPHY\n\nWORK 6 - image collector, 2024\nset of zines\n\ndescription for WORK 6\nIn this work, I seek to reflect upon the ever present and ongoing shift from physical to digital archives, as well as the relationship that we, as casual archivists, have with these newer methods of collecting. Using the built in search feature in the photos app, I look through, sort and organize the images which I have captured in my everyday life into recurring subjects, compiling them into a small collection of zines to create tangible artifacts that allow me to browse through my digital collection in a physical manner.\n",
    "bio": "Flora Tam is a multidisciplinary artist working in ceramics, photography, and most recently, printmaking. With a background in graphic design serving as a guiding light for ventures into new mediums, her ever-evolving practice is centred around a love for the human experience, collecting, and creating play in the everyday.\n",
    "comments": "I do not have a professional looking headshot, I hope the selfie is good enough, sorry in advance! Also hope that the descriptions are adequate, unsure if I was supposed to write whole artist statements for each individual piece. </3\n\nThank you for putting this together!"
  },
  {
    "index": "34",
    "start_time": "4/26/25 0:15:23",
    "completion_time": "4/26/25 0:36:59",
    "email": "pundziusavril@ocadu.ca",
    "name": "Avril Pundzius",
    "modified_time": "",
    "preferred_name": "Avril Pundzius",
    "pronouns": "she/her;",
    "website": "https://pundziusavril.myportfolio.com/",
    "social_media": "Instagram: @pundzius\nbluesky: @poissond-avril.bsky.social",
    "work_email": "pundziusavril@gmail.com",
    "project_name": "project 1: 70 Days of Typography // project 2: The Tarantula Hawk, an informational zine",
    "project_description": "70 Days of Typography was a project in which I designed 70 different versions of the ampersand character as an exercise in type design and exploration. I chose to limit myself to designing these using only pencil and paper as a way to incorporate my personal sketching process, but also to push my design skills without the help of digital tools. I tried to balance both designs that were more illustrative and abstract, as well as some that could later be expanded into a full typeface.\n\nMy project on the tarantula hawk wasp is about portraying insects, specifically stinging hymenoptera (bees, wasps, ants), in a more empathetic and positive light. An area of debate of my topic that interested me was how insects are generally perceived and treated by people; I wanted to explore and challenge negative vs positive conceptions of these animals compared to others.\nThe goal of this project was to challenge the usually negative knee-jerk reaction towards insects and to instead foster a different kind of relationship towards them, whether it be fascination, respect, neutrality or other, to lead towards an understanding of their importance in our natural world. My initial project concept was a series of posters depicting various insects from the Schmidt pain index accompanied by the descriptions of their stings from the index and illustrative visual representations of these colourful descriptions, but I pivoted my outcome to accomplish my goal through a series of informational, explorational zines that can fold out into larger decorative posters.",
    "bio": "I'm Avril, a graphic designer and illustrator from Montréal, currently based in Toronto. I work mainly by transposing analog textures and techniques into a digital space. Retro poster art is something that inspires me to find ways to combine my background in illustration with my graphic design practice and has developed my taste for type and type design.",
    "comments": ""
  },
  {
    "index": "35",
    "start_time": "4/27/25 17:01:50",
    "completion_time": "4/27/25 17:04:20",
    "email": "sandunij@ocadu.ca",
    "name": "Sanduni Jayasekara",
    "modified_time": "",
    "preferred_name": "Sanduni Jayasekara",
    "pronouns": "she/her;",
    "website": "",
    "social_media": "Instagram: @_sandesigns_\nBehance: https://www.behance.net/sandunihansika",
    "work_email": "sanduni.appleid@gmail.com",
    "project_name": "Crakle - branding",
    "project_description": "CRACKL. is an imaginary late-night cereal brand designed for mischievous, unapologetic snackers. Through playful storytelling, dynamic packaging, and immersive branding, I built a bold and engaging experience that brings flavor and attitude to life after dark.",
    "bio": "I'm Sanduni Jayasekara, a graphic designer based in Toronto. I love creating bold, playful branding and packaging experiences. I studied graphic design at OCAD University and enjoy turning ideas into memorable visual worlds. My work, like CRACKL., focuses on storytelling, imagination, and connecting with people through design.",
    "comments": ""
  },
  {
    "index": "36",
    "start_time": "4/28/25 21:11:27",
    "completion_time": "4/28/25 21:15:25",
    "email": "uzoma.ekpunobi@ocadu.ca",
    "name": "Uzoma Ekpunobi",
    "modified_time": "",
    "preferred_name": "Uzoma Ekpunobi",
    "pronouns": "she/they;",
    "website": "https://portfolio-rhyhntg.format.com/",
    "social_media": "Instagram: @oozomss\nTikTok: @capturedbyuzoma",
    "work_email": "capturedbyuzoma@gmail.com",
    "project_name": "My Odyssey Continued: A Renaissance",
    "project_description": "My works combine traditional weaving techniques and organic graphic design to point out the issues of endangered traditional art practices of the Igbo people of Southeastern Nigeria",
    "bio": "Uzoma is a multidisciplinary creative researcher exploring nomadic indigeneity, diaspora, and community. Her work blends documentary, visual journalism, and archival art to examine identity and environment. She supports youth arts programs, promotes cultural preservation, and has exhibited globally. Uzoma holds a BDes from OCAD University and leads community-focused initiatives.",
    "comments": ""
  },
  {
    "index": "37",
    "start_time": "4/29/25 22:36:18",
    "completion_time": "4/29/25 22:50:03",
    "email": "aasiyap@ocadu.ca",
    "name": "Aasiya Punjani",
    "modified_time": "",
    "preferred_name": "Aasiya Punjani",
    "pronouns": "she/her;",
    "website": "aasiyapunjani.xyz",
    "social_media": "Instagram: @aasiya.zp",
    "work_email": "aasiya@outlook.com",
    "project_name": "Intersectionality as Belonging",
    "project_description": "The work I have created over this year targets intersecting identities and finding space where that can exist. I have made tangible artifacts that represent this experience and use design to communicate holding multiple identities. Through researching diaspora and the significance of identity, I have informed my projects and connected different elements of culture to each project within my work. This includes exploration of language, fashion, and personal space.",
    "bio": "I'm Aasiya (she/her) a Toronto based designer and creative. I use design as storytelling, and my practice is built around visual communication or a narrative. To me, design is a tool used to uplift voices and communicate accessibly. I see value in drawing from lived and varying experiences and allowing that to influence the creative process. ",
    "comments": ""
  },
  {
    "index": "38",
    "start_time": "4/30/25 20:49:12",
    "completion_time": "4/30/25 20:54:00",
    "email": "alishbafahim@ocadu.ca",
    "name": "Alishba Fahim",
    "modified_time": "",
    "preferred_name": "Alishba Fahim",
    "pronouns": "she/her;",
    "website": "",
    "social_media": "instagram: @alishba308\ninstagram: @designedby_alishba\nlinkedin: https://www.linkedin.com/in/alishbafahim/",
    "work_email": "alishba.fahim@outlook.com",
    "project_name": "Digital Design Language: Tracing the Cultural Evolution of Web Aesthetics from 2000-2024",
    "project_description": "My thesis project looks at the evolution of web design from the 2000s to 2024, treating websites not just as functional interfaces, but as cultural artifacts. What caused the shift from the expressive, chaotic early internet aesthetics to the standardized templates we see today? This project explores how UX/UI design, especially colour and layout, reflects broader societal changes, like the rise of corporate tech and minimalist branding.\nThe artifacts include a set of screen-sized prints showing dominant colour palettes across three decades, installed as a grid to reflect a visual timeline; a generative animation that breaks down site structures over time; and mini flipbooks tracing iconic websites through their colour and structural changes year by year. Together, the works question what is gained and lost in the pursuit of usability and corporate efficiency, and reflect on how design choices translate cultural shifts. \n",
    "bio": "I’m a Toronto-based graphic designer with a background in photography. I'm drawn to the intersection of design and culture, how aesthetics shape, reflect, and respond to the world around us. I approach design with a balance of structure and exploration, working across various mediums to create reflective and conceptually layered work. My interests span editorial design, timelines, typography, and visual storytelling, often blending clean aesthetics between control and chaos.",
    "comments": "the first 3 image are in a particular order therefore the file names are (order # 1,2,3). the video is one of my artifacts."
  },
  {
    "index": "39",
    "start_time": "5/1/25 13:07:48",
    "completion_time": "5/1/25 13:12:29",
    "email": "saritabeaw@ocadu.ca",
    "name": "Sarita Williams",
    "modified_time": "",
    "preferred_name": "Sarita Williams",
    "pronouns": "she/her;",
    "website": "https://saritabea.format.com",
    "social_media": "Linktree: https://linktr.ee/saritabea.w",
    "work_email": "saritabea.williams@outlook.com",
    "project_name": "TRANSLATION WITHOUT CORRUPTION",
    "project_description": "My work this year consisted of three distinct yet connected projects. Translation Without Corruption is the title for my overarching body of work, as it describes what compelled me to create all of them - this idea that once something becomes a physical object it can no longer be changed or manipulated without destruction, which is what makes artifacts that are accessible to all so precious. \n\nMy first project, CUT/COPY/PASTE/SAVE/, is an evolving bootleg publication that is a collection of writing on bootlegging from various authors and sources. The website is open to all and has all versions of the book available so that anyone can create their own copy. \n\nMy second project, HACK MEDIA, is a collection of information on the development of physical media and its connection to bootlegging, content preservation, and media digestion. \n\nMy final project was fabrication of a CD for a band that fell apart as a way to preserve their music. In doing so, I hope to encapsulate their music/history in the form of a physical object. ",
    "bio": " I’m Sarita Williams, a graphic designer based in Toronto. For my final year at OCAD, I focused on creating artifacts around themes of access, immutable mobiles, and media preservation. In doing so, I hope to continue my objective as a designer/human being to collect and design information that informs and educates. ",
    "comments": "the cover image is for the instagram post but doesn't need to be included in the website ty :)"
  },
  {
    "index": "40",
    "start_time": "5/2/25 0:09:12",
    "completion_time": "5/2/25 0:21:24",
    "email": "kellyla@ocadu.ca",
    "name": "Kelly La",
    "modified_time": "",
    "preferred_name": "Kelly La",
    "pronouns": "she/her;",
    "website": "http://kellyla.ca/",
    "social_media": "- Instagram: @lakalistudios / @itskellyla\n- Linkedin: https://www.linkedin.com/in/itskellyla/",
    "work_email": "lakalistudios@gmail.com",
    "project_name": "Integration of Vietnamese Culture / Research Bibliography Publication",
    "project_description": "Through a research-driven approach, Integration of Vietnamese Culture explores Vietnamese typography and lettering system with a curated textual archive of online articles, books, films, and podcasts. \n\nFocusing on the history and evolution of Vietnamese scripts from Chữ Nho and Chữ Nôm to the modern Latin-based Chữ Quốc Ngữ. Vietnamese typography shares structural similarities with the French script, but its use of diacritics distinguishes it and marks that shift in tone and meaning. As someone who grew up in a Vietnamese-Chinese household, the script is familiar. Despite this cultural closeness, I still experience moments of difficulty when reading Vietnamese type.\n\nThe work invites viewers to see typography not as a tool for communication but as a cultural artifact that reflects Vietnamese typography and lettering systems' history, language, and identity.",
    "bio": "Kelly La (she/her) is a graphic designer, entrepreneur and graphic design graduate from OCAD University. She specializes in brand identity, social media and typography design.\n​​​​​​\nHer work is rooted in creativity, authenticity, and community, with a focus on designing lasting impact. She enjoys exploring typographic projects with experimentative approaches to elevate visual communication.",
    "comments": ""
  },
  {
    "index": "41",
    "start_time": "5/2/25 10:00:08",
    "completion_time": "5/2/25 10:21:08",
    "email": "emcmillan@ocadu.ca",
    "name": "Erin McMillan",
    "modified_time": "",
    "preferred_name": "Erin McMillan",
    "pronouns": "she/her;",
    "website": "https://erinmcmillan.framer.website/",
    "social_media": "Instagram: @erxnmcm",
    "work_email": "erin.mcmillan@hotmail.com",
    "project_name": "A Quiet Archive of Memory",
    "project_description": "I’ve spent the last year collecting voices that aren’t mine. Postcards from strangers. Fragments of thoughts. Sent decades ago, each one a small moment that wasn’t meant to last. Some faded, some blunt, some beautifully mundane. None of them meant for me—yet I found them anyway. And holding them felt like something important. Something that asked to be remembered. This project started with that feeling. That sharp little ache when you realize someone lived an entire life, and what’s left behind is only a sentence or two. A half-thought. It’s not about history, it’s about presence. About how memory clings to small things, and how ordinary moments become the ones that remain. I didn’t only want to preserve these postcards as artifacts. I wanted to listen to them. To let them speak again, in a new way. Through redaction, layering, and touch, I’ve tried to uncover what’s already there, the fragments of memory and the fragility of time. This isn’t a timeline. It’s a kind of emotional archaeology.",
    "bio": "As a multidisciplinary designer and book artist based in Toronto, my practice spans branding, typography, and editorial design, unified by a thoughtful, material-driven approach. My interests within design are rooted in how we communicate — visually, emotionally, and historically. My work often engages with themes of memory, narrative, and sensory experience. I like to approach design as a reflective process that is slow, tactile, and intentional. With a focus on thoughtful storytelling and layered visual language, I explore how design can hold feeling and invite intimacy.",
    "comments": ""
  },
  {
    "index": "42",
    "start_time": "5/3/25 2:22:28",
    "completion_time": "5/3/25 2:25:02",
    "email": "kchen@ocadu.ca",
    "name": "Kelly Chen",
    "modified_time": "",
    "preferred_name": "Kelly Chen",
    "pronouns": "she/her;",
    "website": "https://itskellysfolio.format.com/",
    "social_media": "Instagram: @itskellysfolio\nLinkedIn: www.linkedin.com/in/itskellychen",
    "work_email": "itskellychen@gmail.com",
    "project_name": "Mom Watered the Plants (Again), Oatitude, This Is How I Die",
    "project_description": "Mom Watered the Plants (Again) is an editorial publication that aims to visualize the invisible labour of my mom's care for our houseplants. Designed as a bilingual encyclopedia in English and Chinese, the publication weaves photos, leaf scans, research, and interview notes to document her peaceful rituals and knowledge.\n\nOatitude (pronounced “oh-ti-tood”) is a conceptual oat-based brand that aims to educate and nourish families across Ontario. With a product line of milk, yogurt, and ice cream, Oatitude explores how packaging can drive social change by addressing humanitarian themes of sustainability, food literacy, and quality education.\n\nThis Is How I Die is an opening title sequence for a conceptual Netflix original TV series based on a 'virus' narrative by my classmate Sterling Wedge (@vinetouched). It depicts the relationship between humans and nanobot spiders by combining traditional frame-by-frame and digital animation.",
    "bio": "Hi! I'm Kelly, a Toronto-based designer with a Bachelor of Design (BDes) from OCAD University. I specialize in branding, editorial, and motion design, driven by strong research-led thinking. My work often blends clever visual storytelling with a commitment to using design as a catalyst for positive change and social good.",
    "comments": ""
  },
  {
    "index": "43",
    "start_time": "5/6/25 15:27:44",
    "completion_time": "5/6/25 15:44:47",
    "email": "jcalvo@ocadu.ca",
    "name": "Julian Calvo",
    "modified_time": "",
    "preferred_name": "Julian Calvo",
    "pronouns": "he/him;",
    "website": "https://jcalvo.format.com/",
    "social_media": "Instagram: @julian_calv\nLinkedin: @julian-calvo",
    "work_email": "juliancalvo599@gmail.com",
    "project_name": "A Face Half-Lit, A Face Still Concealed",
    "project_description": "The film noir style and genre of popular cinematic films in the 1940s and 1950s inspired this series of photos. Many noir films often exude feelings of pessimism, fatalism, and menace, which usually feature malevolent or despicable characters in ominous settings and atmospheres, with many of their features frequently covered by shadows and a lack of light.\n\nThe story follows a girl and explores the progression of her two-faced personality. The shadows conceal her and reflect her confident and strong personality, while the light exposes who she truly is underneath, as a more vulnerable individual. The prints are categorized from left to right and from up and down, demonstrating the transition from shadow to light as a symbolization of it taking place, creating a timeline of events.",
    "bio": "My name is Julian, an inspiring graphic designer and photographer looking to expand my horizons within these mediums to their absolute potential. I am interested in ways that they can portray countless messages and viewpoints, and I love to explore and create. I am hardworking and friendly to get along with!",
    "comments": ""
  },
  {
    "index": "44",
    "start_time": "5/10/25 9:49:01",
    "completion_time": "5/10/25 10:11:24",
    "email": "eliang@ocadu.ca",
    "name": "Emily Liang",
    "modified_time": "",
    "preferred_name": "Emily Liang",
    "pronouns": "she/her;",
    "website": "www.emliang.com",
    "social_media": "instagram: @liang_Illustration\nLinkedin: https://www.linkedin.com/in/liangemily/",
    "work_email": "emily.liang0205@gmail.com",
    "project_name": "Discover Montreal Island! - Board Game",
    "project_description": "This interactive and playable board game is about traveling through the island of Montreal, my beautiful home city. Players get to experience different journeys every time they play and encounter unexpected obstacles that are iconic to the city. After choosing a transportation mode and collect as many cards, tickets of Montreal's many landmarks, quintessential food, and coins as possible.\n\n",
    "bio": "Hi, I'm Emily! An illustrator and graphic designer based in Toronto, Canada. After completing her training in the Illustration program from Dawson College in Montreal, she moved to Toronto to pursue further education in Graphic Design at OCAD University. My work can be described as very graphic, clean, colorful, and visually pleasing. ",
    "comments": ""
  },
  {
    "index": "45",
    "start_time": "5/10/25 11:58:54",
    "completion_time": "5/10/25 12:20:55",
    "email": "noura.khaki@ocadu.ca",
    "name": "Noura Khaki",
    "modified_time": "",
    "preferred_name": "Noura Khaki",
    "pronouns": "she/her;",
    "website": "",
    "social_media": "Instagram: @nourathedesigner \nLinkedin: @ noura khaki",
    "work_email": "Noura.khaaki@gmail.com ",
    "project_name": "  \"Ghebleh-ye Alam\" (قبلهی عالم)",
    "project_description": "Through imagined artifacts and satirical design, this exhibition creates a dialogue between past and present, inviting viewers to reflect on how commerce, power, and cultural identity intersect. Blurring the line between fantasy and reality, the work uses design as a critical lens to explore how value and taste are constructed and circulated across time.\nThis exhibition explores how graphic design can reimagine consumer branding within a speculative 19th-century Qajar setting to critique Western influence on cultural identity. Set in 1873, during the reign of Naser al-Din Shah Qajar, a ruler captivated by European culture, the project envisions a fictional scenario where modern global brands appear within the Persian royal court. At its center is an imagined letter from the Shah to his favoured consort, Anis al-Dawla, accompanied by  “gifts” inspired by his travels abroad.",
    "bio": "Iranian designer Noura Khaki explores speculative narratives through storytelling, visual design, and fictional artifacts. Rooted in curiosity and historical reference, her work challenges dominant realities by asking “What if?” Blending imagination with critique, she redefines design as a tool for inquiry, disruption, and reimagining the world around us.",
    "comments": ""
  },
  {
    "index": "46",
    "start_time": "5/14/25 10:18:34",
    "completion_time": "5/14/25 11:14:44",
    "email": "laurie.nehme@ocadu.ca",
    "name": "Laurie Nehme",
    "modified_time": "",
    "preferred_name": "Laurie Nehme",
    "pronouns": "she/her;",
    "website": "",
    "social_media": "Instagram: @lauriesfolio\nLinkedin: Laurie Nehme",
    "work_email": "nehmelaurie@gmail.com",
    "project_name": "Urban Design & Cities",
    "project_description": "How do we connect emotionally and sustainably to the cities we live in? 🌱\n\nUrban Life explores this through two pieces centered on Toronto: a field guide to the Harbourfront and a student-focused housing app, Warmlee.\n\nThe Field Guide documents the rhythms of life at the Harbourfront of Toronto using photography, mapping, and observation. It highlights how weather, wildlife, and urban design intersect — urging readers to see overlooked public spaces as vital to wellbeing and environmental balance.\nIt is ultimately about rethinking how we co-create sustainable living systems by learning about the overlooked aspects of some of Toronto’s natural spaces across Lake Ontario. By connecting the Field Guide to the housing application I am able to showcase a solution to physical problems and the importance of natural and often overlooked public spaces through digital (animation and application) and physical (Field Guide book and site research) mediums that encourage city navigation, exploration, and connection to others.\n\nTogether, the works blend reflection with functionality — one helping us pause and observe, the other helping us move through the city with confidence. Both ask: how can design make urban life more thoughtful, livable, and human?",
    "bio": "Laurie Nehme is a Toronto‑based designer who builds authentic design experiences rooted in clarity, storytelling, and social impact. She holds an Honours Bachelor of Design (BDes) in Graphic Design from OCAD University where she focuses on product design, user experience, and people‑first functional packaging and graphic design.\n\nShaped by the city’s fast-moving creative and tech scene, Laurie creates meaningful and thoughtful digital and physical design solutions that tell a story.\n\n-- For more work and behind the scenes process, visit @lauriesfolio on instagram.",
    "comments": ""
  },
  {
    "index": "47",
    "start_time": "5/14/25 13:38:44",
    "completion_time": "5/14/25 14:00:38",
    "email": "zaidirfan@ocadu.ca",
    "name": "Zaid Irfan",
    "modified_time": "",
    "preferred_name": "Zaid Irfan",
    "pronouns": "he/him;",
    "website": "https://zaid-irfan-portfolio.vercel.app/",
    "social_media": "Are.na: https://www.are.na/zaid-irfan/channels\nLinkedin: @zaidirfan0107",
    "work_email": "zaidirfan@ocadu.ca",
    "project_name": "Reverie Blight / Video",
    "project_description": "It is difficult to say what I had intended in creating this short film. The process behind its making was one that was highly meditative, and that relied most on having to burrow into the recesses of my own (un)conscious mind, memories, and experiences. There is then a kind of emptiness that is meant to be evoked by the film, as it was made following a kind of existential breaking point that left me questioning what I had originally thought I knew about myself. The title of the film, which describes the decay and death of a fantasy and/or dream, serves to reflect how I have felt myself losing touch with my own dreams, and thus my own being.",
    "bio": "Zaid's practice straddles between many different disciplines, with illustration, writing, filmmaking, animation, publication design, 3D modeling, and web development being the most recurring. In creating any work, however, he retains the core objective of creating worlds and stories that are true to his own idiosyncrasies and individual experiences.",
    "comments": "Video work is too big, so here are the links to the Vimeo page, plus the link for the iframe. let me know if this poses any issues\n\nregular: https://vimeo.com/1079160685\n\niframe: <iframe src=\"https://player.vimeo.com/video/1079160685?title=0&amp;byline=0&amp;portrait=0&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" width=\"1280\" height=\"720\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture; clipboard-write; encrypted-media\" title=\"zaid_irfan-reverie_blight\"></iframe>"
  },
  {
    "index": "48",
    "start_time": "5/16/25 23:15:32",
    "completion_time": "5/16/25 23:44:47",
    "email": "pegah.resalat.panah@ocadu.ca",
    "name": "Pegah Resalat Panah",
    "modified_time": "",
    "preferred_name": "Pegah Resalatpanah",
    "pronouns": "she/her;",
    "website": "https://www.brianthecactus.com/",
    "social_media": "Instagram: @brianthecactus_\nLinkedin: @PegahResalat",
    "work_email": "pegahresalatpanah@yahoo.com",
    "project_name": "Shapes of Censorship",
    "project_description": "This project investigates the symbols, shapes, and motifs which have emerged from the censorship of Iranian artists and the suppression of Iranian culture. It examines how visual language develops under heavy restrictions, using abstraction, omission, and coded references as tools shaped by necessity. Drawing from both past and present examples, this work reflects how Iranian identity is altered and hidden as a result of government control. Every piece highlights aspects of culture and history which have been changed, silenced, and erased. ",
    "bio": "Pegah (she/her) is a Toronto based graphic designer with a Bachelor of Design from OCAD University. Her practice is rooted in print media, publication design, and tactile forms of communication. Her work is shaped by a strong connection to material processes and a deep interest in cultural identity, often reflecting her Iranian heritage and its vibrant design history. She is particularly inspired by experimental, place-based, and hands on approaches to design.",
    "comments": ""
  },
  {
    "index": "49",
    "start_time": "5/16/25 23:49:20",
    "completion_time": "5/16/25 23:59:31",
    "email": "bjung@ocadu.ca",
    "name": "Ba Da Jung",
    "modified_time": "",
    "preferred_name": "BD : J",
    "pronouns": "she/her;",
    "website": "https://www.behance.net/bbj8",
    "social_media": "",
    "work_email": "nunanart@protonmail.com",
    "project_name": "Unessay",
    "project_description": "emotion",
    "bio": "Hi",
    "comments": "\n"
  }
]
